{
  "data": [
    {
      "date": "Jun 2023 - May 2024",
      "title": "Junior Software Developer",
      "company": "Third Storage",
      "location": "Bengaluru, Karnataka, India · Remote",
      "content": [
        "Developed and maintained Third Storage Localhost, an open-source backend-as-a-service (BaaS) platform, optimizing core client-side functionality with React.js & Next.js to reduce load times by 30%.",
        "Integrated third-party authentication and external APIs into web applications, reducing manual data handling by 30% and improving developer efficiency.",
        "Integrated Redux for state management, reducing unnecessary re-renders by 25% and enhancing data flow consistency.",
        "Applied TypeScript to enhance code quality and maintainability across the project, lowering runtime errors and improving developer collaboration."
      ]
    },
        {
      "date": "Feb 2023 - May 2023",
      "title": "Software Developer Intern",
      "company": "Third Storage",
      "location": "Bengaluru, Karnataka, India · Remote",
      "content": [
        "Designed and built 20+ reusable UI components using Tailwind CSS, improving design consistency and accelerating front-end development.",
        "Wrote unit and integration tests with Jest, increasing test coverage by 40% and reducing production regression bugs by 20%.",
        "Acquired hands-on experience with Web3 and blockchain architecture, applying distributed computing principles in real-world implementations."
      ]
    },
    {
      "date": "Nov 2021 - Dec 2021",
      "title": "Web Development Intern",
      "company": "MoE's Innovation Cell",
      "location": "Delhi, India · Remote",
      "content": [
        "Contributed to the development of the Smart India Hackathon 2022 platform, enabling secure idea submissions and evaluations for over 160,000+ students, significantly enhancing national-scale participation.",
        "Developed a responsive, cross-device UI using JavaScript and Bootstrap, improving accessibility and reducing user drop-off by an estimated 25% during peak registration periods.",
        "Implemented backend logic with Django and MySQL, including role-based authentication that streamlined access control for thousands of admin, evaluator, and participant accounts."
      ]
    }
  ]
}
